(function () {
  let chalisa_in_String =
    "जय हनुमान ज्ञान गुन सागर । जय कपीस तिहुँ लोक उजागर ॥१॥ राम दूत अतुलित बल धाम अंजनिपुत्र पवनसुत नामा ॥२॥ महाबीर विक्रम बजरंगी । कुमति निवार सुमति के संगी ॥३॥ कंचन बरन बिराज सुबेसा । कानन कुंडल कुँचित केसा ॥४॥ हाथ वज्र औ ध्वजा बिराजे । काँधे मूँज जनेऊ साजे ॥५॥ संकर स्वयं केसरी नंदन । तेज प्रताप महा जग वंदन ॥६॥ विद्यावान गु‌‍‍णी अति चातुर । राम काज करिबे को आतुर ॥७॥ प्रभु चरित्र सुनिबे को रसिया । राम लखन सीता मनबसिया ॥८॥ सूक्ष्म रूप धरि सियहि दिखावा । बिकट रूप धरि लंक जरावा ॥९॥ भीम रूप धरि असुर संहारे । रामचंद्र के काज सवाँरे ॥१०॥ लाऐ संजीवन लखन जियाए । श्री रघुबीर हरषि उर लाए ॥११॥ रघुपति कीन्ही बहुत बड़ाई । तुम मम प्रिय भरत-हि सम भाई ॥१२॥ सहस बदन तुम्हरो यस गावै । अस कहि श्रीपति कंठ लगावै ॥१३॥ सनकादिक ब्रह्मादि मुनीसा । नारद सारद सहित अहीसा ॥१४॥ यम कुबेर दिगपाल जहाँ ते । कवि कोविद कहि सके कहाँ ते ॥१५॥ तुम उपकार सुग्रीवहि कीन्हा । राम मिलाय राज पद दीन्हा ॥१६॥ तुम्हरो मंत्र बिभीषण माना । लंकेश्वर भये सब जग जाना ॥१७॥ जुग सहस्त्र योजन पर भानू । लील्यो ताहि मधुर फ़ल जानू ॥१८॥ प्रभु मुद्रिका मेलि मुख माही । जलधि लाँघि गए अचरज नाही ॥१९॥ दुर्गम काज जगत के जेते । सुगम अनुग्रह तुम्हरे तेते ॥२०॥ राम दुआरे तुम रखवारे । होत न आज्ञा बिनु पैसारे ॥२१॥ सब सुख लहै तुम्हारी सरना । तुम रक्षक काहू को डरना ॥२२॥ आपन तेज सम्हारो आपै । तीनहूं लोक हाँक ते काँपै ॥२३॥ भूत पिशाच निकट नहि आवै । महाबीर जब नाम सुनावै ॥२४॥ नासै रोग हरे सब पीरा । जपत निरंतर हनुमत बीरा ॥२५॥ संकट तें हनुमान छुडावै । मन क्रम वचन ध्यान जो लावै ॥२६॥ सब पर राम राय सिर ताजा । तिनके काज सकल तुम साजा ॥२७॥ और मनोरथ जो कोई लावै । सोइ अमित जीवन फल पावै ॥२८॥ चारों जुग परताप तुम्हारा । है परसिद्ध जगत उजियारा ॥२९॥ साधु संत के तुम रखवारे । असुर निकंदन राम दुलारे ॥३०॥ अष्ट सिद्धि नौ निधि के दाता । अस बर दीन जानकी माता ॥३१॥ राम रसायन तुम्हरे पासा । सादर हो रघुपति के दासा ॥३२॥ तुम्हरे भजन राम को पावै । जनम जनम के दुख बिसरावै ॥३३॥ अंतकाल रघुवरपुर जाई । जहाँ जन्म हरिभक्त कहाई ॥३४॥ और देवता चित्त ना धरई । हनुमत सेई सर्व सुख करई ॥३५॥ संकट कटै मिटै सब पीरा । जो सुमिरै हनुमत बलबीरा ॥३६॥ जै जै जै हनुमान गोसाई । कृपा करहु गुरु देव की नाई ॥३७॥ यह सत बार पाठ कर जोई । छूटहि बंदि महा सुख होई ॥३८॥ जो यह पढ़े हनुमान चालीसा । होय सिद्धि साखी गौरीसा ॥३९॥ तुलसीदास सदा हरि चेरा । कीजै नाथ हृदय मँह डेरा ॥४०॥";

  let words = chalisa_in_String.split(" ");
  const query = document.querySelector(".count");

  function printWord(index) {
    if (index < words.length) {
      let p = document.createElement("p");
      p.innerHTML = `${words[index]} `;
      p.style.wordSpacing = "10px";
      p.style.letterSpacing = "1px";
      p.style.display = "inline";
      query.appendChild(p);

      const speechSynthesis = window.speechSynthesis;
      const speechText = new SpeechSynthesisUtterance(words[index]);
      speechSynthesis.speak(speechText);

      setTimeout(() => {
        printWord(index + 1);
      }, 200);
    }
  }

  printWord(0);
})();
